Ran Plan for 2 projects:

1. dir: `poc/dev/fulfillment` workspace: `default`
1. dir: `.` workspace: `default`

### 1. dir: `poc/dev/fulfillment` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudbuild_trigger.github will be created
  + resource "google_cloudbuild_trigger" "github" {
      + create_time   = (known after apply)
      + description   = "Build and deploy fulfillment-controller to Cloud Run"
      + filename      = "cloudbuild.yaml"
      + id            = (known after apply)
      + name          = "fulfillment-controller"
      + project       = (known after apply)
      + substitutions = {
          + "_APP_ENV"         = "dev"
          + "_DEPLOY_REGIONS"  = "us-east1,us-central1"
          + "_EXPOSE_PORT"     = "5000"
          + "_GCR_HOSTNAME"    = "us.gcr.io"
          + "_SERVICE_ACCOUNT" = "fulfillment-controller@ccai-df-mva-lab1.iam.gserviceaccount.com"
          + "_SERVICE_NAME"    = "fulfillment-controller"
        }
      + trigger_id    = (known after apply)

      + github {
          + name  = "fulfillment-controller"
          + owner = "tandonc"

          + push {
              + branch = ".*"
            }
        }
    }

  # google_secret_manager_secret.basic_auth_pass will be created
  + resource "google_secret_manager_secret" "basic_auth_pass" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "******************"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret.client_api_key will be created
  + resource "google_secret_manager_secret" "client_api_key" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "*****************"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret.flask_session_key will be created
  + resource "google_secret_manager_secret" "flask_session_key" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "********************"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_version.basic_auth_pass_v1 will be created
  + resource "google_secret_manager_secret_version" "basic_auth_pass_v1" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.client_api_key_v1 will be created
  + resource "google_secret_manager_secret_version" "client_api_key_v1" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.flask_session_key_v1 will be created
  + resource "google_secret_manager_secret_version" "flask_session_key_v1" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # random_password.FC_BASIC_AUTH_PASS will be created
  + resource "random_password" "FC_BASIC_AUTH_PASS" {
      + id          = (known after apply)
      + keepers     = {
          + "version" = "1"
        }
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.FC_CLIENT_API_KEY will be created
  + resource "random_password" "FC_CLIENT_API_KEY" {
      + id          = (known after apply)
      + keepers     = {
          + "version" = "1"
        }
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.FC_FLASK_SESSION_KEY will be created
  + resource "random_password" "FC_FLASK_SESSION_KEY" {
      + id          = (known after apply)
      + keepers     = {
          + "version" = "1"
        }
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.project_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/secretmanager.secretAccessor--serviceAccount:fulfillment-controller@ccai-df-mva-lab1.iam.gserviceaccount.com"] will be created
  + resource "google_project_iam_member" "project_iam_additive" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fulfillment-controller@ccai-df-mva-lab1.iam.gserviceaccount.com"
      + project = "ccai-df-mva-lab1"
      + role    = "roles/secretmanager.secretAccessor"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---
### 2. dir: `.` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
exit status 1: running "/home/atlantis/plan.sh" in "/home/atlantis/.atlantis/repos/tandonc/terraform-google-ccai/4/default": 
Error: Error in function call

  on /home/atlantis/.atlantis/repos/tandonc/terraform-google-ccai/4/default/terragrunt.hcl line 3, in locals:
   3:   env_vars = read_terragrunt_config(find_in_parent_folders("env.hcl"))

Call to function "find_in_parent_folders" failed: ParentFileNotFound: Could not
find a env.hcl in any of the parent folders of
/home/atlantis/.atlantis/repos/tandonc/terraform-google-ccai/4/default/terragrunt.hcl.
Cause: Traversed all the way to the root..

[terragrunt] 2020/11/23 02:48:13 Encountered error while evaluating locals.
[terragrunt] 2020/11/23 02:48:13 /home/atlantis/.atlantis/repos/tandonc/terraform-google-ccai/4/default/terragrunt.hcl:3,37-60: Error in function call; Call to function "find_in_parent_folders" failed: ParentFileNotFound: Could not find a env.hcl in any of the parent folders of /home/atlantis/.atlantis/repos/tandonc/terraform-google-ccai/4/default/terragrunt.hcl. Cause: Traversed all the way to the root..
[terragrunt] 2020/11/23 02:48:13 Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```
</details>

---

